#ifndef __EH100_H
#define __EH100_H 			   
#include <sys.h>	
//时间结构体
typedef struct
{
  int  year;
	char month;
	char day;
	char hour;
	char minute;
	char second;
}TIME; 

//5路温度及8路模拟量结构体
typedef struct
{
  float  temperatur1;
  float  temperatur2;
	float  temperatur3;
	float  temperatur4;
	float  temperatur5;
	float  fanSpeed;
	float  humidity;	
	float  CO2;
	float  NH3;
	float presure1;
	float presure2;
	float presure3;
}ANALOG;

const  char MENU0[7][6]={"1 控制","2 设备","3 管理","4 历史","5校准","6 安装","7 测试"};   //一级菜单
 const  char MENU1[7][12]={"1.1 温度曲线","1.2 风级大小","1.3 湿度控制","1.4 CO2控制","1.5 系统参数","1.6 控制模式","1.7 系统状态"};   //
 const  char MENU2[11][13]={"2.1 通风级别","2.2 调速级别","2.3 进风级别","2.4 地沟风机","2.5 湿帘水泵","2.6 加热设备","2.7 照明设备","2.8 料线设备","2.9 刮粪设备","2.10 额外系统","2.11 定时器"};
 const  char MENU3[9][12]={"3.1 动物数量","3.2 动物日龄","3.3 报警设定","3.4 报警重置","3.5 软件版本","3.6 配置读取","3.7 配置写入","3.8 系统配置","3.9 出场设置"};
 const  char MENU4[8][8]={"4.1 温度","4.2 湿度","4.3 用水","4.4 用料","4.5 死亡","4.6 加热","4.7 报警","4.8 事件"};
 const  char MENU5[5][14]={"5.1 温度校准","5.2 湿度校准","5.3 CO2校准","5.4 水电料校准","5.5 湿帘校准"};
 const  char MENU6[9][20]={"6.1 继电器功能选择","6.2 温度传感器数量","6.3 模拟输入功能选择","6.4 数字输入功能选择","6.5 模拟输出功能选择","6.6 温度功能选择","6.7 进风口设置","6.8 风机风量设置","6.9 调速风机设置"};
 const  char MENU7[4][18]={"7.1 继电器测试","7.2 模拟量输出测试","7.3 模拟量输入测试","7.4 外设状态查询"};
 const  char MENU11[6][14]={"1.1.1 日龄","1.1.2 目标温度","1.1.3 加热温度","1.1.4 纵向温度","1.1.5 低报温度","1.1.6 高报温度"};
 const  char MENU12[3][14]={"1.2.1 日龄","1.2.2 最大风级","1.2.3 最小风级"};	
 const  char MENU13[6][14]={"1.3.1 湿度启用","1.3.2 目标湿度","1.3.3 延迟(分)","1.3.4 持续(秒)","1.3.5 过渡湿度","1.3.6 温低停湿"}; 
 const  char MENU14[7][18]={"1.4.1 CO2启用","1.4.2 开启浓度","1.4.3 关闭浓度","1.4.4 通风延迟(分)","1.4.5 增级持续(秒)","1.4.6 低温退CO2","1.4.7 温降幅度"}; 
 const  char MENU15[16][15]={"1.5.1 风机循环","1.5.2 舍外寒冷","1.5.3 舍外温暖","1.5.4 级别控制","1.5.5 防冻保护","1.5.6 纵向通风","1.5.7 舍内退出","1.5.8 退出延迟","1.5.9 调整安全","1.5.10 增级延迟","1.5.11 降级延迟","1.5.12 舒适区域","1.5.13 软温过渡","1.5.14 低骤降值","1.5.15 高骤降值","1.5.16 制冷因数"}; 
 const  char MENU16[2][10]={"1.6.1 空舍","1.6.2 正常"}; 
 const  char MENU17[9][16]={"1.7.1 系统温度","1.7.2 传感器状态","1.7.3 系统目标","1.7.4 进风口位置","1.7.5 报警状态","1.7.6 调速状态","1.7.7 继电器状态","1.7.8 系统功能","1.7.9 密码登录"}; 
 
 const  char MENU24[5][14]={"2.4.1 地沟启用","2.4.2 调整安全","2.4.3 通风温差","2.4.4 开启时间","2.4.5 关闭时间"}; 
 const  char MENU25[7][14]={"2.5.1 湿度启用","2.5.2 目标湿度","2.5.3 延迟(分)","2.5.4 持续(秒)","2.5.5 过渡区域","2.5.6 低于加热","2.5.7 降温幅度"}; 
 const  char MENU26[3][10]={"2.6.1 地暖","2.6.2 热灯","2.6.3 热板"};  
 const  char MENU27[1][14]={"2.7.1 照明启用"}; 
 const  char MENU28[2][14]={"2.8.1 料线启用","2.8.2 料满检测"}; 
 const  char MENU29[5][14]={"2.9.1 刮粪启用","2.9.2 前进到位","2.9.3 后退到位","2.9.4 刮粪开启","2.9.5 刮粪间隔"}; 
 const  char MENU2A[4][16]={"2.10.1 开始-结束","2.10.2 低温-高温","2.10.3 开启时间","2.10.4 关闭时间"}; 
 const  char MENU2B[3][16]={"2.11.1 开始-结束","2.11.2 开启时间","2.11.3 关闭时间"}; 

 const  char MENU31[5][14]={"3.1.1 猪只总数","3.1.2 剩余数量","3.1.3 当日减少","3.1.4 当日增加","3.1.5 当日死亡"}; 
 const  char MENU32[8][6]={"","","","","","","",""}; 
 const  char MENU33[4][14]={"3.3.1 报警延时","3.3.2 报警低限","3.3.3 报警高限","3.3.4 紧急温度"}; 

 const  char MENU38[2][16]={"3.8.1 本机编号","3.8.2 本机IP地址"}; 
 const  char MENU55[2][14]={"5.5.1 滑帘开启","5.5.2 滑帘关闭"}; 
 const  char MENU261[4][16]={"2.6.1.1 地暖启用","2.6.1.2 地暖回差","2.6.1.3 地暖开温","2.6.1.4 地暖关温"}; 
 const  char MENU262[4][16]={"2.6.2.1 热灯启用","2.6.2.2 热灯回差","2.6.2.3 热灯开温","2.6.2.4 热灯关温"}; 
 const  char MENU263[3][16]={"2.6.3.1 热板启用","2.6.3.2 热板开启","2.6.3.3 热板间隔"}; 
/* const  char MENU23[8][6]={"","","","","","","",""}; 
 const  char MENU34[8][6]={"","","","","","","",""}; 
 const  char MENU35[8][6]={"","","","","","","",""}; 
 const  char MENU36[8][6]={"","","","","","","",""}; 
 const  char MENU37[8][6]={"","","","","","","",""};  */
 const  char ALARM1[8]="温度超高";
 const  char ALARM2[8]="温度过低"; 
 const  char ALARM3[8]="湿度超高";
 const  char ALARM4[8]="湿度过低";  
 const  char ALARM5[8]="CO2超高";
 const  char ALARM6[8]="NH3超高"; 
 const  char ALARM7[9]="负压1超限";
 const  char ALARM8[9]="负压2超限";
 const  char ALARM9[9]="负压3超限"; 
 float  waterMeter;    //水表
 float  voltmeter;     //电表
 float  fodderWeight;  //饲料重量
 TIME Time;
 ANALOG Analogs;
 int alarmNum=0x0000;

#endif
