#ifndef __MENU_TEST_H
#define __MENU_TEST_H
#include "sys.h" 
#define Menu_Cnt 164   //分支节点和叶子节点总共163个
#define EndMenuItem(val)  (u16)val|0x8000     //如果本菜单项为本级末尾项，则索引号最高位置1
typedef void(*FUNC_POINT)(void);
/*
typedef struct _menuItem{
	union{
		unsigned char ID;
		unsigned char NexID; 
	}idx;
	MenuHandler OnClick;
}MenuItem; 
MenuItem code menus[Menu_Cnt]={
	{0,Menu_Handler}, //0
	{1,Menu_Handler}, //1
	{2,Menu_Handler}, //2
	{5,Menu_Handler}, //3
	{EndMenuItem(7),Menu_Handler}, //4
	{5,Menu_Handler}, //5
	{EndMenuItem(6),Menu_Handler}, //6
	{7,Menu_Handler}, //7
	{8,Menu_Handler}, //8
	{9,Menu_Handler}, //9
	{11,Menu_Handler}, //10
	{11,Menu_Handler}, //11
	{EndMenuItem(12),Menu_Handler}, //12		
	}
}*/
typedef struct _menuItem{
	u16 index;  //菜单项索引 最高位
	char *menuName;      //菜单项名称	 
	FUNC_POINT OnClick;
}MenuItem; 

const MenuItem AllMenuItems[Menu_Cnt]={
	{1,"系统状态 ",NULL},  // 索引号为1，表示有子菜单，且子菜单编号为1，另外，有待将NULL 改为对应页面显示函数
	{8,"1 控制 ",NULL}, //索引号为8，表示有子菜单,首个编号为8
	{15,"2 设备 ",NULL}, //
	{26,"3 管理 ",NULL}, //
	{35,"4 历史 ",NULL}, //
	{43,"5 校准 ",NULL}, //
	{48,"6 安装 ",NULL}, //
	{EndMenuItem((u16)57),"7 测试 ",NULL}, //
	{61,"1.1 温度曲线",NULL}, //
	{67,"1.2 风级大小",NULL}, //
	{70,"1.3 湿度控制",NULL}, //
	{76,"1.4 CO2控制",NULL}, //
	{83,"1.5 系统参数",NULL}, //
	{99,"1.6 控制模式 ",NULL}, //
	{EndMenuItem((u16)101),"1.7 系统状态",NULL}, //
	{15,"2.1 通风级别 ",NULL}, //
	{16,"2.2 调速级别",NULL}, //
	{17,"2.3 进风级别",NULL}, //
	{110,"2.4 地沟风机",NULL}, //
	{115,"2.5 湿帘水泵",NULL}, //
	{122,"2.6 加热设备",NULL}, //
	{125,"2.7 照明设备",NULL}, //
	{126,"2.8 料线设备",NULL}, //
	{128,"2.9 刮粪设备",NULL}, //
	{133,"2.10 额外系统",NULL}, //
	{EndMenuItem((u16)137),"2.11 定时器",NULL}, //
	{140,"3.1 动物数量",NULL}, //
	{27,"3.2 动物日龄",NULL}, //
	{145,"3.3 报警设定",NULL}, //
	{29,"3.4 报警重置",NULL}, //
	{30,"3.5 软件版本",NULL}, //
	{31,"3.6 配置读取",NULL}, //
	{32,"3.7 配置写入",NULL}, //
	{149,"3.8 系统配置",NULL}, //
	{EndMenuItem((u16)34),"3.9 出厂设置",NULL}, //
	{35,"4.1 温度",NULL}, //
	{36,"4.2 湿度",NULL}, //
	{37,"4.3 用水",NULL}, //
	{38,"4.4 用料",NULL}, //
	{39,"4.5 死亡",NULL}, //
	{40,"4.6 加热",NULL}, //
	{41,"4.7 报警",NULL}, //
	{EndMenuItem((u16)42),"4.8 事件",NULL}, //
	{43,"5.1 温度校准",NULL}, //
	{44,"5.2 湿度校准",NULL}, //
	{45,"5.3 CO2校准",NULL}, //
	{46,"5.4 水电料校准",NULL}, //
	{EndMenuItem((u16)151),"5.5 滑帘校准",NULL}, //
	{48,"6.1 继电器功能选择",NULL}, //
	{49,"6.2 温度传感器数量",NULL}, //
	{50,"6.3 模拟输入功能选择",NULL}, //
	{51,"6.4 数字输入功能选择",NULL}, //
	{52,"6.5 模拟输出功能选择",NULL}, //
	{53,"6.6 温度功能选择",NULL}, //
	{54,"6.7 进风口设置",NULL}, //
	{55,"6.8 风机风量设置",NULL}, //
	{EndMenuItem((u16)56),"6.9 调速风机设置",NULL}, //
	{57,"7.1 继电器测试",NULL}, //
	{58,"7.2 模拟量输出测试",NULL}, //
	{59,"7.3 模拟量输入测试",NULL}, //
	{EndMenuItem((u16)60),"7.4 外设状态查询",NULL}, //
	{61,"1.1.1 日龄",NULL}, //
	{62,"1.1.2 目标温度",NULL}, //
	{63,"1.1.3 加热温度",NULL}, //
	{64,"1.1.4 纵向温度",NULL}, //
	{65,"1.1.5 低报温度",NULL}, //
	{EndMenuItem((u16)66),"1.1.6 高报温度",NULL}, //
	{67,"1.2.1 日龄",NULL}, //
	{68,"1.2.2 最大风级",NULL}, //
	{EndMenuItem((u16)69),"1.2.3 最小风级",NULL}, //
	{70,"1.3.1 湿度启用",NULL}, //
	{71,"1.3.2 目标湿度",NULL}, //
	{72,"1.3.3 延迟(分)",NULL}, //
	{73,"1.3.4 持续(秒)",NULL}, //
	{74,"1.3.5 过渡湿度",NULL}, //
	{EndMenuItem((u16)75),"1.3.6 温低停湿",NULL}, //
	{76,"1.4.1 CO2启用",NULL}, //
	{77,"1.4.2 开启浓度",NULL}, //
	{78,"1.4.3 关闭浓度",NULL}, //
	{79,"1.4.4 通风延迟(分)",NULL}, //
	{80,"1.4.5 增级持续(秒)",NULL}, //
	{81,"1.4.6 温低退CO2",NULL}, //
	{EndMenuItem((u16)82),"1.4.7 温降幅度",NULL}, //
	{83,"1.5.1 风机循环",NULL}, //
	{84,"1.5.2 舍外寒冷",NULL}, //
	{85,"1.5.3 舍外温暖",NULL}, //
	{86,"1.5.4 级别控制",NULL}, //
	{87,"1.5.5 防冻保护",NULL}, //
	{88,"1.5.6 纵向通风",NULL}, //
	{89,"1.5.7 舍内退出",NULL}, //
	{90,"1.5.8 退出延迟",NULL}, //
	{91,"1.5.9 调整安全",NULL}, //
	{92,"1.5.10 增级延迟",NULL}, //
	{93,"1.5.11 降级延迟",NULL}, //
	{94,"1.5.12 舒适区域",NULL}, //
	{95,"1.5.13 软温过渡",NULL}, //
	{96,"1.5.14 低骤降值",NULL}, //
	{97,"1.5.15 高骤降值",NULL}, //
	{EndMenuItem((u16)98),"1.5.16 制冷因数",NULL}, //
	{99,"1.6.1 空舍",NULL}, //
	{EndMenuItem((u16)100),"1.6.2 正常",NULL}, //
	{101,"1.7.1 系统温度",NULL}, //
	{102,"1.7.2 传感器状态",NULL}, //
	{103,"1.7.3 系统目标",NULL}, //
	{104,"1.7.4 进风口位置",NULL}, //
	{105,"1.7.5 报警状态",NULL}, //
	{106,"1.7.6 调速状态",NULL}, //
	{107,"1.7.7 继电器状态",NULL}, //
	{108,"1.7.8 系统功能",NULL}, //
	{EndMenuItem((u16)109),"1.7.9 密码登录",NULL}, //
	{110,"2.4.1 地沟启用",NULL}, //
	{111,"2.4.2 调整安全",NULL}, //
	{112,"2.4.3 通风温差",NULL}, //
	{113,"2.4.4 开启时间",NULL}, //
	{EndMenuItem((u16)114),"2.4.5 关闭时间",NULL}, //
	{115,"2.5.1 湿度启用",NULL}, //
	{116,"2.5.2 目标湿度",NULL}, //
	{117,"2.5.3 延迟(分)",NULL}, //
	{118,"2.5.4 持续（秒）",NULL}, //
	{119,"2.5.5 过渡区域",NULL}, //
	{120,"2.5.6 低于加热",NULL}, //
	{EndMenuItem((u16)121),"2.5.7 降温幅度",NULL}, //
	{153,"2.6.1 地暖",NULL}, //
	{157,"2.6.2 热灯",NULL}, //
	{EndMenuItem((u16)161),"2.6.3 热板",NULL}, //
	{EndMenuItem((u16)161),"2.7.1 照明启用",NULL}, //
	{126,"2.8.1 料线启用",NULL}, //
	{EndMenuItem((u16)127),"2.8.2 料满检测",NULL}, //
	{128,"2.9.1 刮粪启用",NULL}, //
	{129,"2.9.2 前进到位",NULL}, //
	{130,"2.9.3 后退到位",NULL}, //
	{131,"2.9.4 刮粪开启",NULL}, //
	{EndMenuItem((u16)132),"2.9.5 刮粪间隔",NULL}, //
	{133,"2.10.1 开始-结束 ",NULL}, //
	{134,"2.10.2 低温-高温",NULL}, //
	{135,"2.10.3 开启时间",NULL}, //
	{EndMenuItem((u16)136),"2.10.4 关闭时间",NULL}, //
	{137,"2.11.1 开始-结束",NULL}, //
	{138,"2.11.2 开启时间",NULL}, //
	{EndMenuItem((u16)139),"2.11.3 关闭时间",NULL}, //
	{140,"3.1.1 猪只总数",NULL}, //
	{141,"3.1.2 剩余数量",NULL}, //
	{142,"3.1.3 当日减少",NULL}, //
	{143,"3.1.4 当日增加",NULL}, //
	{EndMenuItem((u16)144),"3.1.5 当日死亡",NULL}, //
	{145,"3.3.1 报警延时",NULL}, //
	{146,"3.3.2 报警低限",NULL}, //
	{147,"3.3.3 报警高限",NULL}, //
	{EndMenuItem((u16)148),"3.3.4 紧急温度",NULL}, //
	{149,"3.8.1 本机编号",NULL}, //
	{EndMenuItem((u16)150),"3.8.2 本机IP地址",NULL}, //
	{151,"5.5.1 滑帘开启",NULL}, //
	{EndMenuItem((u16)152),"5.5.2 滑帘关闭",NULL}, //
	{153,"2.6.1.1 地暖启用",NULL}, //
	{154,"2.6.1.2 地暖回差",NULL}, //
	{155,"2.6.1.3 地暖开温",NULL}, //
	{EndMenuItem((u16)156),"2.6.1.4 地暖关温",NULL}, //
	{157,"2.6.2.1 热灯启用",NULL}, //
	{158,"2.6.2.2 热灯回差",NULL}, //
	{159,"2.6.2.3 热灯开温",NULL}, //
	{EndMenuItem((u16)160),"2.6.2.4 热灯关温",NULL}, //
	{161,"2.6.3.1 热板启用",NULL}, //
	{162,"2.6.3.2 热板开启",NULL}, //
	{EndMenuItem((u16)163),"2.6.3.3 热板间隔",NULL} //

};

#endif

